# data loading

In [9]:
import pandas as pd
import numpy as np
df=pd.read_csv('Position_Salaries.csv')
df.head()

5.5

In [ ]:
df.shape

In [ ]:
df.size

In [12]:
df['Level'].mean()

5.5

In [14]:
df.columns

Index(['Position', 'Level', 'Salary'], dtype='object')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Position  10 non-null     object
 1   Level     10 non-null     int64
 2   Salary    10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [20]:
df2=df.head(2)
df2.head()

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000

In [25]:
df3=df2['Salary'] # took out a single column from the table
print(type(df3))

<class 'pandas.core.series.Series'>

In [26]:
df2['Level']+10

0    11
1    12
Name: Level, dtype: int64